In [1]:
import pandas as pd

In [14]:
df =[['A',1,2,3],
      ['B',4,5,6],
      ['C',7,8,9],
      ['D',11,12,13],
      ['E',14,15,16],
      ['F',17,18,19],
      ['G',21,22,23],
      ['H',24,25,26],
      ['I',27,28,29],
      ['J',31,32,33],
      ['K',34,35,36],
      ['L',37,38,39]]

df2 = [['A',1,8,7,True,1,0,1],
       ['A',6,5,4,False,1,1,1],
       ['B',4,2,1,True,1,1,1],
       ['C',19,18,17,True,1,0,1],
       ['C',16,15,14,False,1,0,0],
       ['D',13,12,11,False,1,0,0],
       ['D',39,38,37,False,1,0,0],
       ['D',36,35,34,False,1,0,0],
       ['D',23,22,21,False,1,0,0],
       ['F',49,48,47,False,1,0,0],
       ['F',46,45,44,False,1,0,1],
       ['F',53,52,51,False,0,0,1],
       ['H',49,48,47,True,0,0,0],
       ['K',46,45,44,True,0,0,0],
       ['M',53,52,51,False,0,0,0],
       ['K',49,48,47,False,0,0,1],
       ['M',46,45,44,True,0,0,1],
       ['M',53,52,51,True,0,0,1]]

df3 = [['A','High',0],
       ['B','Low',1],
       ['C','High',2]]

df4 = [['A','High',0],
       ['B','Low',1],
       ['C','High',2],
       ['C','High',0],
       ['D','Low',1],
       ['D','High',0]]

df5 = [['D','Low',2],
       ['E','Low',1],
       ['F','High',2]]

df6 = [['G','Low',2,2],
       ['H','Low',1,1],
       ['I','High',2,1]]

df7 = [['D','Low',2],
       ['E','Low',1],
       ['E','Low',1],
       ['E','Low',1],
       ['F','High',2]]

df = pd.DataFrame(df, columns=['ID','X','Y','Z'])
df2 = pd.DataFrame(df2, columns=['ID','X','YY','ZZ','TF','XX','XY','XZ'])
df3 = pd.DataFrame(df3, columns=['ID','O','OP'])
df4 = pd.DataFrame(df4, columns=['ID2','O2','OP2'])
df5 = pd.DataFrame(df5, columns=['ID','O','OP'])
df6 = pd.DataFrame(df6, columns=['ID','O','OP','OP3'])
df7 = pd.DataFrame(df7, columns=['ID','O','OP'])

In [20]:
# Simple Merge "Join" datasets
df_merged = df.merge(df2, on='ID', suffixes=('_df','_df2'))
df_merged.head()

  ID  X_df  Y  Z  X_df2  YY  ZZ     TF  XX  XY  XZ
0  A     1  2  3      1   8   7   True   1   0   1
1  A     1  2  3      6   5   4  False   1   1   1
2  B     4  5  6      4   2   1   True   1   1   1
3  C     7  8  9     19  18  17   True   1   0   1
4  C     7  8  9     16  15  14  False   1   0   0

In [46]:
# Merge with multiple cols
df_merged = df.merge(df2, on= ['ID','X'])
df_merged.head()

  ID  X  Y  Z  YY  ZZ    TF  XX  XY  XZ
0  A  1  2  3   8   7  True   1   0   1
1  B  4  5  6   2   1  True   1   1   1

In [24]:
# Merge multiple tables 
df_merged = df.merge(df2, on='ID') \
            .merge(df3, on='ID')
df_merged.head()

  ID  X_x  Y  Z  X_y  YY  ZZ     TF  XX  XY  XZ     O  OP
0  A    1  2  3    1   8   7   True   1   0   1  High   0
1  A    1  2  3    6   5   4  False   1   1   1  High   0
2  B    4  5  6    4   2   1   True   1   1   1   Low   1
3  C    7  8  9   19  18  17   True   1   0   1  High   2
4  C    7  8  9   16  15  14  False   1   0   0  High   2

In [25]:
# LeftJoin Pandas
df_merged_left = df.merge(df2, on='ID', how='left')
df_merged.head()

  ID  X_x  Y  Z  X_y  YY  ZZ     TF  XX  XY  XZ     O  OP
0  A    1  2  3    1   8   7   True   1   0   1  High   0
1  A    1  2  3    6   5   4  False   1   1   1  High   0
2  B    4  5  6    4   2   1   True   1   1   1   Low   1
3  C    7  8  9   19  18  17   True   1   0   1  High   2
4  C    7  8  9   16  15  14  False   1   0   0  High   2

In [31]:
# Diferents Keys
df_merged = df3.merge(df4, left_on='ID', right_on='ID2', how='right')
df_merged.head()

    ID     O   OP ID2    O2  OP2
0    A  High  0.0   A  High    0
1    B   Low  1.0   B   Low    1
2    C  High  2.0   C  High    2
3    C  High  2.0   C  High    0
4  NaN   NaN  NaN   D   Low    1

In [44]:
# Full Outer Joins
df_merged = df.merge(df3, on='ID', how='outer')
df_merged.head()

  ID   X   Y   Z     O   OP
0  A   1   2   3  High  0.0
1  B   4   5   6   Low  1.0
2  C   7   8   9  High  2.0
3  D  11  12  13   NaN  NaN
4  E  14  15  16   NaN  NaN

In [ ]:
# Self Join Example

# Merge the crews table to itself
crews_self_merged = crews.merge(crews, on='id', how='inner',
                                suffixes=('_dir','_crew'))

# Create a boolean index to select the appropriate rows
boolean_filter = ((crews_self_merged['job_dir'] == 'Director') & 
                  (crews_self_merged['job_crew'] != 'Director'))
direct_crews = crews_self_merged[boolean_filter]

# Print the first few rows of direct_crews
print(direct_crews.head())

In [53]:
# Join with indexes using left and right on
df_merged = df3.merge(df5, right_index=True, left_index=True)
df_merged.head()

  ID_x   O_x  OP_x ID_y   O_y  OP_y
0    A  High     0    D   Low     2
1    B   Low     1    E   Low     1
2    C  High     2    F  High     2

In [54]:
# Semi Join (Rows that are in DF and in DF2)
df_merged = df.merge(df2, on='ID')
df_semi = df[df['ID'].isin(df_merged['ID'])]
df_semi

   ID   X   Y   Z
0   A   1   2   3
1   B   4   5   6
2   C   7   8   9
3   D  11  12  13
5   F  17  18  19
7   H  24  25  26
10  K  34  35  36

In [62]:
# Anti Join (Rows from DF that are not in DF2)
df_merged = df.merge(df2, on='ID', how='left', indicator=True)
df_anti = df_merged.loc[df_merged['_merge'] == 'left_only']
df_anti

   ID  X_x   Y   Z  X_y  YY  ZZ   TF  XX  XY  XZ     _merge
9   E   14  15  16  NaN NaN NaN  NaN NaN NaN NaN  left_only
13  G   21  22  23  NaN NaN NaN  NaN NaN NaN NaN  left_only
15  I   27  28  29  NaN NaN NaN  NaN NaN NaN NaN  left_only
16  J   31  32  33  NaN NaN NaN  NaN NaN NaN NaN  left_only
19  L   37  38  39  NaN NaN NaN  NaN NaN NaN NaN  left_only

In [63]:
# Concat
df_concat = pd.concat([df5,df6])
df_concat.head(10)

  ID     O  OP  OP3
0  D   Low   2  NaN
1  E   Low   1  NaN
2  F  High   2  NaN
0  G   Low   2  2.0
1  H   Low   1  1.0
2  I  High   2  1.0

In [64]:
# Concat add Index 
df_concat = pd.concat([df5,df6], ignore_index=False, keys=['from_df5','from_df6'])
df_concat.head(10)

           ID     O  OP  OP3
from_df5 0  D   Low   2  NaN
         1  E   Low   1  NaN
         2  F  High   2  NaN
from_df6 0  G   Low   2  2.0
         1  H   Low   1  1.0
         2  I  High   2  1.0

In [5]:
# Concat with diferent cols
df_concat = pd.concat([df5,df6])
df_concat.head()

  ID     O  OP  OP3
0  D   Low   2  NaN
1  E   Low   1  NaN
2  F  High   2  NaN
0  G   Low   2  2.0
1  H   Low   1  1.0

In [4]:
# Concat only with matching cols
df_concat = pd.concat([df5,df6], join='inner')
df_concat.head()

  ID     O  OP
0  D   Low   2
1  E   Low   1
2  F  High   2
0  G   Low   2
1  H   Low   1

In [7]:
# Append Example
df_concat= df5.append(df6, ignore_index=True)
df_concat.head()

  ID     O  OP  OP3
0  D   Low   2  NaN
1  E   Low   1  NaN
2  F  High   2  NaN
3  G   Low   2  2.0
4  H   Low   1  1.0

In [12]:
# Validate Merge (Make sure of the relationship of tables)
try:
    df.merge(df2, validate='one_to_one') # one_to_many, many_to_one, many_to_many
    print('Wow look a one to one relationship')
except Exception as ex:
    print(ex)

Merge keys are not unique in right dataset; not a one-to-one merge

In [21]:
# Verify Integrity Concat
try:
    pd.concat([df5,df7], verify_integrity=True)
except Exception as ex:
    print(ex)
    print('Showing without verify_integrity')
    print(pd.concat([df5,df7], verify_integrity=False))

Indexes have overlapping values: Int64Index([0, 1, 2], dtype='int64')
Showing without verify_integrity
  ID     O  OP
0  D   Low   2
1  E   Low   1
2  F  High   2
0  D   Low   2
1  E   Low   1
2  E   Low   1
3  E   Low   1
4  F  High   2